read_verilog -sv hw/*
hierarchy -top cpu
synth_ecp5